Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: https://camel.apache.org/camel-quarkus/[Camel Quarkus^] is a subproject in the https://camel.apache.org/[Apache Camel^] community that enables Camel to run on https://developers.redhat.com/products/quarkus/overview[Quarkus^]. Apache Camel, often called the swiss-knife of integration, is the most popular open source community project aimed at solving all things integration.
ja_jp: link:https://camel.apache.org/camel-quarkus/[Camel Quarkus, window=_blank]は、 link:https://camel.apache.org/[Apache Camel, window=_blank]コミュニティのサブプロジェクトで、 link:https://developers.redhat.com/products/quarkus/overview[Quarkus, window=_blank]上でCamelを実行できるようにするものです。Apache Camelは、しばしばインテグレーションのスイス・アーミーナイフと呼ばれ、インテグレーションに関するあらゆることを解決することを目的とした、最も人気のあるオープンソースコミュニティプロジェクトです。

source: https://chocolatey.org[Chocolatey] is a package manager for Windows.
ja_jp: https://chocolatey.org[Chocolatey] は、Windows 向けのパッケージマネージャーです。

source: https://cloud.google.com/[A Google Cloud Account]. Free accounts work.
ja_jp: link:https://cloud.google.com/[Google Cloudのアカウント] 。無料アカウントが使えます。

source: https://cloud.google.com/sdk[Cloud SDK CLI Installed]
ja_jp: link:https://cloud.google.com/sdk[Cloud SDK CLI がインストールされていること]

source: https://cloud.redhat.com/[Red Hat OpenShift Streams for Apache Kafka] provides managed Kafka brokers. First, follow the instructions from https://access.redhat.com/documentation/en-us/red_hat_openshift_streams_for_apache_kafka/1/guide/88e1487a-2a14-4b35-85b9-a7a2d67a37f3[Getting started with the `rhoas` CLI for Red Hat OpenShift Streams for Apache Kafka] to create your Kafka broker instance. Make sure you copied the client id and client secret associated with the _ServiceAccount_ you created.
ja_jp: https://cloud.redhat.com/[Red Hat OpenShift Streams for Apache Kafka] は、マネージド Kafka ブローカーを提供します。まず、 https://access.redhat.com/documentation/en-us/red_hat_openshift_streams_for_apache_kafka/1/guide/88e1487a-2a14-4b35-85b9-a7a2d67a37f3[Getting started with the `rhoas` CLI for Red Hat OpenShift Streams for Apache Kafka] の指示に従い、Kafka ブローカーインスタンスを作成します。作成した _ServiceAccount_ に関連付けられているクライアント ID とクライアントシークレットをコピーしたことを確認してください。

source: https://cloudevents.io/[Cloud Events] is a specification for describing events. It aims to ease interoperability. With the rise of event-driven architecture, it's not surprising to see Cloud Events gaining popularity.
ja_jp: https://cloudevents.io/[クラウドイベントは]、イベントを記述するための仕様です。相互運用性を容易にすることを目的としています。イベント駆動型アーキテクチャの台頭により、Cloud Eventsの人気が高まっているのは驚くに値しません。

source: https://code.quarkus.io/?g=its.subatomic&a=subatomic-particles-generator&v=1.0.0-SNAPSHOT&b=MAVEN&s=xTN&cn=code.quarkus.io[Here on code.quarkus.io,role=external,window=_blank]
ja_jp: https://code.quarkus.io/?g=its.subatomic&amp;a=subatomic-particles-generator&amp;v=1.0.0-SNAPSHOT&amp;b=MAVEN&amp;s=xTN&amp;cn=code.quarkus.io[code.quarkus.ioでは、以下のようになっています。, role=external, window=_blank]

source: https://code.quarkus.io[code.quarkus.io, window="_blank"] (find the extensions tagged with [code])
ja_jp: link:https://code.quarkus.io[code.quarkus.io, window=_blank]（[code]とタグ付けされたエクステンションを探す）

source: https://commons.apache.org/proper/commons-logging/[Apache Commons Logging]
ja_jp: link:https://commons.apache.org/proper/commons-logging/[Apache Commons Logging]

source: https://cryostat.io/[Cryostat's upstream website^]
ja_jp: https://cryostat.io/[Cryostat's upstream ウェブサイト^]

source: https://datatracker.ietf.org/doc/html/rfc7592[OAuth2 Dynamic Client Registration Management Protocol]
ja_jp: https://datatracker.ietf.org/doc/html/rfc7592[OAuth2 動的クライアント登録管理プロトコル]

source: https://datatracker.ietf.org/doc/html/rfc8705[RFC8705] describes a mechanism for binding access tokens to Mutual TLS (mTLS) client authentication certificates. It requires that a client certificate's SHA256 thumbprint matches a JWT token or token introspection confirmation `x5t#S256` certificate thumbprint.
ja_jp: https://datatracker.ietf.org/doc/html/rfc8705[RFC8705] では、アクセストークンを Mutual TLS (mTLS) クライアント認証証明書にバインドするメカニズムについて説明しています。 クライアント証明書の SHA256 サムプリントが JWT トークンまたはトークンイントロスペクション確認 `x5t#S256` 証明書サムプリントと一致する必要があります。

source: https://datatracker.ietf.org/doc/html/rfc9449[RFC9449] describes a Demonstrating Proof of Possession (DPoP) mechanism for cryprographically binding an access token to the current client, preventing the access token loss and replay.
ja_jp: link:https://datatracker.ietf.org/doc/html/rfc9449[RFC9449]は 、アクセストークンを現在のクライアントに暗号的にバインドし、アクセストークンの紛失やリプレイを防ぐためのDemonstrating Proof of Possession（DPoP）メカニズムについて記述しています。

source: https://datatracker.ietf.org/doc/rfc9728/[OAuth2 Protected Resource Metadata] specification defines a metadata format enabling OAuth 2.0 clients to obtain information needed to interact with an OAuth 2.0 protected resource.
ja_jp: https://datatracker.ietf.org/doc/rfc9728/[OAuth2 Protected Resource Metadata] 仕様は、OAuth 2.0 クライアントが OAuth 2.0 保護リソースと対話するために必要な情報を取得できるメタデータ形式を定義しています。

source: https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI installed]
ja_jp: link:https://devcenter.heroku.com/articles/heroku-cli[Heroku CLIのインストール]

source: https://developers.redhat.com/articles/2021/10/26/configuring-java-applications-use-cryostat[Setup guide for Java Application to use Cryostat on the Red Hat Developers blog^]
ja_jp: link:https://developers.redhat.com/articles/2021/10/26/configuring-java-applications-use-cryostat[Red Hat DevelopersブログのCryostatを使用するためのJavaアプリケーションのセットアップガイド, window=_blank]

source: https://developers.redhat.com/articles/2021/11/02/java-monitoring-custom-targets-cryostat[Guide for using Cryostat Custom Targets on the Red Hat Developers blog^]
ja_jp: link:https://developers.redhat.com/articles/2021/11/02/java-monitoring-custom-targets-cryostat[Red Hat DevelopersブログのCryostatカスタムターゲットの使用に関するガイド, window=_blank]

source: https://developers.redhat.com/articles/2023/04/12/why-you-should-use-iouring-network-io[Why you should use io_uring for network I/O]: The main benefit of io_uring for network I/O is a modern asynchronous API that is straightforward to use and provides unified semantics for file and network I/O. A potential performance benefit of io_uring for network I/O is reducing the number of syscalls. This could provide the biggest benefit for high volumes of small operations where the overhead of system calls can be significant.
ja_jp: https://developers.redhat.com/articles/2023/04/12/why-you-should-use-iouring-network-io[Why you should use io_uring for network I/O]: ネットワーク I/O に対する io_uring の主な利点は、ファイルとネットワーク I/O に統一されたセマンティクスを提供する使いやすい最新の非同期 API です。 ネットワーク I/O に対する io_uring の潜在的なパフォーマンス上の利点は、システムコールの数を減らすことです。 これは、大量の小規模な操作により、システムコールのオーバーヘッドが大きくなる可能性がある場合に最大の利点をもたらす可能性があります。

source: https://developers.redhat.com/blog/2020/12/08/spring-boot-to-quarkus-migrations-and-more-in-red-hats-migration-toolkit-for-applications-5-1-0/[Spring Boot to Quarkus migrations with MTA] (in developers.redhat.com)
ja_jp: link:https://developers.redhat.com/blog/2020/12/08/spring-boot-to-quarkus-migrations-and-more-in-red-hats-migration-toolkit-for-applications-5-1-0/[MTAによるSpring BootからQuarkusへ]の移行(developers.redhat.com 内)

source: https://developers.redhat.com/blog/2021/01/25/introduction-to-containerjfr-jdk-flight-recorder-for-containers[Cryostat^] is a profiling and monitoring tool that leverages the https://developers.redhat.com/blog/2020/08/25/get-started-with-jdk-flight-recorder-in-openjdk-8u[JDK Flight Recorder^] (JFR) framework already present in your Java applications running on the HotSpot JVM. Cryostat provides an in-cluster collection hub for easy and secure access to your JDK Flight Recorder data from outside the cluster. Cryostat is a cloud-native application primarily targeting deployment on OpenShift, so this guide will assume you are also deploying your Quarkus applications to OpenShift for simplicity.
ja_jp: link:https://developers.redhat.com/blog/2021/01/25/introduction-to-containerjfr-jdk-flight-recorder-for-containers[Cryostat, window=_blank]は、HotSpot JVM 上で動作する Java アプリケーションに既に存在する link:https://developers.redhat.com/blog/2020/08/25/get-started-with-jdk-flight-recorder-in-openjdk-8u[JDK Flight Recorder, window=_blank](JFR) フレームワークを活用したプロファイリングおよび監視ツールです。Cryostatは、クラスタ内の収集ハブを提供し、クラスタ外からJDK Flight Recorderデータに簡単かつ安全にアクセスすることができます。Cryostatは、主にOpenShiftへのデプロイをターゲットとするクラウドネイティブアプリケーションです。したがって、このガイドでは、わかりやすくするために、QuarkusアプリケーションもOpenShiftにデプロイしているものと仮定します。

source: https://developers.redhat.com/blog/2021/01/25/introduction-to-containerjfr-jdk-flight-recorder-for-containers[Introduction to Cryostat on the Red Hat Developers blog^]
ja_jp: link:https://developers.redhat.com/blog/2021/01/25/introduction-to-containerjfr-jdk-flight-recorder-for-containers[Red Hat DevelopersブログでのCryostatの紹介, window=_blank]

source: https://dl.acm.org/doi/10.1145/3583678.3596895[Considerations for integrating virtual threads in a Java framework: a Quarkus example in a resource-constrained environment]
ja_jp: link:https://dl.acm.org/doi/10.1145/3583678.3596895[Javaフレームワークにおける仮想スレッドの統合に関する考察：リソース制約環境におけるQuarkusの例]

source: https://docs.aws.amazon.com/lambda/latest/dg/snapstart.html[SnapStart] is a snapshotting and restore mechanism reducing drastically the cold startup time of Java functions on AWS. This document explains the various settings you can use to leverage this feature. It is not a reference documentation on SnapStart, and it will not cover how SnapStart works in details.
ja_jp: link:https://docs.aws.amazon.com/lambda/latest/dg/snapstart.html[SnapStart] は、AWS上のJava関数のコールドスタートアップ時間を大幅に短縮するスナップショット・リストアの仕組みです。このドキュメントでは、この機能を活用するためのさまざまな設定について説明します。SnapStartのリファレンスドキュメントではないので、SnapStartの動作の詳細については説明しません。

source: https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI], for local testing
ja_jp: link:https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] 、ローカルテスト用

source: https://docs.kogito.kie.org/latest/html_single/[Kogito Documentation]
ja_jp: https://docs.kogito.kie.org/latest/html_single/[Kogitoドキュメント]

source: https://docs.microsoft.com/en-us/azure/aks/tutorial-kubernetes-deploy-cluster?WT.mc_id=opensource-quarkus-brborges[Tutorial: Deploy an Azure Kubernetes Service (AKS) cluster]
ja_jp: link:https://docs.microsoft.com/en-us/azure/aks/tutorial-kubernetes-deploy-cluster?WT.mc_id=opensource-quarkus-brborges[チュートリアル: Azure Kubernetes Service (AKS) クラスターのデプロイ]

source: https://docs.microsoft.com/en-us/azure/app-service/containers/tutorial-custom-docker-image?WT.mc_id=opensource-quarkus-brborges[Tutorial: Build a custom image and run in App Service from a private registry]
ja_jp: link:https://docs.microsoft.com/en-us/azure/app-service/containers/tutorial-custom-docker-image?WT.mc_id=opensource-quarkus-brborges[チュートリアル: カスタムイメージを作成し、プライベートレジストリーからApp Serviceで実行する]

source: https://docs.microsoft.com/en-us/azure/container-instances/container-instances-using-azure-container-registry?WT.mc_id=opensource-quarkus-brborges[Deploy to Azure Container Instances from Azure Container Registry]
ja_jp: link:https://docs.microsoft.com/en-us/azure/container-instances/container-instances-using-azure-container-registry?WT.mc_id=opensource-quarkus-brborges[Azure Container RegistryからAzure Container Instancesへのデプロイ]

source: https://docs.microsoft.com/en-us/azure/event-hubs/event-hubs-for-kafka-ecosystem-overview[Azure Event Hub] provides an endpoint compatible with Apache Kafka.
ja_jp: https://docs.microsoft.com/en-us/azure/event-hubs/event-hubs-for-kafka-ecosystem-overview[Azure Event Hub] は、Apache Kafka と互換性のあるエンドポイントを提供します。

source: https://docs.microsoft.com/en-us/cli/azure/install-azure-cli[Azure CLI Installed]
ja_jp: link:https://docs.microsoft.com/en-us/cli/azure/install-azure-cli[Azure CLIがインストールされていること]

source: https://docs.oracle.com/javacomponents/jmc-5-4/jfr-runtime-guide/about.htm#JFRUH170[Java Flight Recorder (JFR)] and https://www.oracle.com/java/technologies/jdk-mission-control.html[JDK Mission Control (JMC)] can be used to profile native binaries since GraalVM CE 21.2.0. However, JFR in GraalVM is currently limited in capabilities compared to HotSpot. The custom event API is fully supported, but some VM level features are unavailable. More events and JFR features will continue to be added in later releases. The following table outlines Native Image JFR support and limitations by version.
ja_jp: link:https://docs.oracle.com/javacomponents/jmc-5-4/jfr-runtime-guide/about.htm#JFRUH170[Java Flight Recorder（JFR] ）と link:https://www.oracle.com/java/technologies/jdk-mission-control.html[JDK Mission Control（JMC] ）は、GraalVM CE 21.2.0以降、ネイティブ・バイナリのプロファイリングに使用することができます。 しかしながら、GraalVMにおけるJFRはHotSpotと比較して限定されています。 カスタム・イベントAPIは完全にサポートされていますが、一部のVMレベルの機能は利用できません。 より多くのイベントと JFR 機能は、後のリリースで追加され続ける予定です。 以下の表は、バージョンごとのネイティブ・イメージの JFR サポートと制限の概要です。

source: https://docs.oracle.com/javacomponents/jmc-5-4/jfr-runtime-guide/about.htm#JFRUH170[Java Flight Recorder (JFR)] and https://www.oracle.com/java/technologies/jdk-mission-control.html[JDK Mission Control (JMC)] can be used to profile native binaries since GraalVM CE 21.2.0. However, JFR in GraalVM is currently significantly limited in capabilities compared to HotSpot. The custom event API is fully supported, but many VM level features are unavailable. They will be added in future releases. Current limitations are:
ja_jp: link:https://docs.oracle.com/javacomponents/jmc-5-4/jfr-runtime-guide/about.htm#JFRUH170[Java Flight Recorder(JFR)]と link:https://www.oracle.com/java/technologies/jdk-mission-control.html[JDK Mission Control(JMC)]は、GraalVM CE 21.2.0以降、プロファイル・ネイティブ・バイナリのデバッグに使用することができます。 しかし、GraalVMのJFRは現在、HotSpotと比較して機能が大幅に制限されています。カスタムイベントAPIは完全にサポートされていますが、多くのVMレベルの機能は利用できません。これらは将来のリリースで追加される予定です。現在の制限事項は以下の通りです。

source: https://docs.quarkiverse.io/quarkus-chicory/dev[Quarkus Chicory Extension]
ja_jp: https://docs.quarkiverse.io/quarkus-chicory/dev[Quarkus Chicory エクステンション]

source: https://docs.quarkiverse.io/quarkus-cxf/dev/reference/extensions/quarkus-cxf.html#quarkus-cxf_quarkus-cxf-client-client-name-proxy-configuration-name[quarkus-cxf] (since version 3.31.0)
ja_jp: https://docs.quarkiverse.io/quarkus-cxf/dev/reference/extensions/quarkus-cxf.html#quarkus-cxf_quarkus-cxf-client-client-name-proxy-configuration-name[quarkus-cxf] (バージョン 3.31.0 以降)

source: https://docs.quarkiverse.io/quarkus-quinoa/dev/[Quarkus Quinoa] bridges your npm-compatible web application and Quarkus for both dev and prod. No need to install Node.js or configure your framework, it will detect it and use sensible defaults.
ja_jp: link:https://docs.quarkiverse.io/quarkus-quinoa/dev/[Quarkus Quinoa] 、はnpm互換のウェブアプリケーションとQuarkusの橋渡しをします。Node.jsをインストールしたり、フレームワークを設定したりする必要はありません。

source: https://drools.org/learn/dmn.html[What is DMN]
ja_jp: link:https://drools.org/learn/dmn.html[DMNとは]

source: https://dzone.com/articles/the-backend-revolution-or-why-io-uring-is-so-impor[The Backend Revolution and Why io_uring Is So Important]: The io_uring API uses two ring buffers for communication between application and kernel (hence the API name) and designed in a way that enables natural batching of requests and responses. Besides, it provides a way to submit multiple requests in one system call, which can reduce overhead.
ja_jp: https://dzone.com/articles/the-backend-revolution-or-why-io-uring-is-so-impor[The Backend Revolution and Why io_uring Is So Important]: io_uring API は、アプリケーションとカーネル間の通信に 2 つのリングバッファーを使用し (これが API 名の由来です)、リクエストとレスポンスの自然なバッチ処理を可能にするように設計されています。 さらに、1 回のシステムコールで複数のリクエストを送信する方法を提供するため、オーバーヘッドを削減できます。

source: https://en.wikipedia.org/wiki/YAML[YAML] is a very popular format. Kubernetes relies heavily on the YAML format to write the various resource descriptors.
ja_jp: link:https://en.wikipedia.org/wiki/YAML[YAML]はとても人気のあるフォーマットです。Kubernetesは、さまざまなリソース記述子を記述するためにYAMLフォーマットに大きく依存しています。

source: https://flywaydb.org/[Flyway] is a popular database migration tool that is commonly used in JVM environments.
ja_jp: link:https://flywaydb.org/[Flyway] は、JVM環境でよく使われているデータベースマイグレーションツールです。

source: https://forms.gle/qJi2eVq8sSc3xv2Z9[Sign Up] or send us an mailto:worldtour@quarkus.io[email] to help.
ja_jp: link:https://forms.gle/qJi2eVq8sSc3xv2Z9[サインアップ]、または link:mailto:worldtour@quarkus.io[メール]でお問い合わせください。

source: https://github.com/FasterXML/jackson[Jackson support]
ja_jp: https://github.com/FasterXML/jackson[Jackson サポート]

source: https://github.com/a2aproject/a2a-java/blob/main/README.md[A2A Java SDK Documentation]
ja_jp: https://github.com/a2aproject/a2a-java/blob/main/README.md[A2A Java SDK ドキュメント]

source: https://github.com/a2aproject/a2a-java/releases/tag/v1.0.0.Alpha2[Release Notes on GitHub]
ja_jp: https://github.com/a2aproject/a2a-java/releases/tag/v1.0.0.Alpha2[GitHub 上のリリースの注記]

source: https://github.com/a2aproject/a2a-samples/tree/main/samples/java/agents[A2A Java SDK Samples]
ja_jp: https://github.com/a2aproject/a2a-samples/tree/main/samples/java/agents[A2A Java SDK サンプル]

source: https://github.com/dylibso/chicory[Chicory WebAssembly Runtime]
ja_jp: https://github.com/dylibso/chicory[Chicory WebAssembly ランタイム]

source: https://github.com/jakartaee/jsonb-api/[JSON-B support]
ja_jp: link:https://github.com/jakartaee/jsonb-api/[JSON-B サポート]

source: https://github.com/jboss-logging/jboss-logging[JBoss Logging]
ja_jp: link:https://github.com/jboss-logging/jboss-logging[JBoss ロギング]

source: https://github.com/kubernetes/minikube[Minikube] is quite popular when a Kubernetes cluster is needed for development purposes. To make the deployment to Minikube experience as frictionless as possible, Quarkus provides the `quarkus-minikube` extension. This extension can be added to a project like so:
ja_jp: https://github.com/kubernetes/minikube[Minikube] は、開発目的でKubernetesクラスタが必要な場合に非常に人気があります。Minikubeへのデプロイをできるだけ摩擦のないものにするために、Quarkusは `quarkus-minikube` エクステンションを提供しています。このエクステンションは、以下のようなプロジェクトに追加することができます。

source: https://github.com/phillip-kruger/quarkus-jokes/blob/f572ed6f949de0c0b8cbfa99d7389ab5168fea65/deployment/src/main/java/io/quarkus/jokes/deployment/devui/JokesDevUIProcessor.java#L87[Example code]
ja_jp: https://github.com/phillip-kruger/quarkus-jokes/blob/f572ed6f949de0c0b8cbfa99d7389ab5168fea65/deployment/src/main/java/io/quarkus/jokes/deployment/devui/JokesDevUIProcessor.java#L87[サンプルコード]

source: https://github.com/phillip-kruger/quarkus-jokes/blob/f572ed6f949de0c0b8cbfa99d7389ab5168fea65/deployment/src/main/java/io/quarkus/jokes/deployment/devui/JokesDevUIProcessor.java#LL71C16-L71C16[Example code]
ja_jp: https://github.com/phillip-kruger/quarkus-jokes/blob/f572ed6f949de0c0b8cbfa99d7389ab5168fea65/deployment/src/main/java/io/quarkus/jokes/deployment/devui/JokesDevUIProcessor.java#LL71C16-L71C16[サンプルコード]

source: https://github.com/phillip-kruger/quarkus-jokes/blob/f572ed6f949de0c0b8cbfa99d7389ab5168fea65/deployment/src/main/resources/dev-ui/qwc-jokes-vaadin.js#L374[Example code]
ja_jp: https://github.com/phillip-kruger/quarkus-jokes/blob/f572ed6f949de0c0b8cbfa99d7389ab5168fea65/deployment/src/main/resources/dev-ui/qwc-jokes-vaadin.js#L374[サンプルコード]

source: https://github.com/phillip-kruger/quarkus-jokes/blob/f572ed6f949de0c0b8cbfa99d7389ab5168fea65/runtime/src/main/java/io/quarkus/jokes/runtime/JokesJsonRPCService.java#L37[Example code]
ja_jp: https://github.com/phillip-kruger/quarkus-jokes/blob/f572ed6f949de0c0b8cbfa99d7389ab5168fea65/runtime/src/main/java/io/quarkus/jokes/runtime/JokesJsonRPCService.java#L37[サンプルコード]

source: https://github.com/phillip-kruger/quarkus-jokes/blob/main/deployment/src/main/resources/dev-ui/qwc-jokes-log.js[Example code]
ja_jp: https://github.com/phillip-kruger/quarkus-jokes/blob/main/deployment/src/main/resources/dev-ui/qwc-jokes-log.js[サンプルコード]

source: https://github.com/phillip-kruger/quarkus-jokes/blob/main/deployment/src/main/resources/dev-ui/qwc-jokes-web-components.js[Example code]
ja_jp: https://github.com/phillip-kruger/quarkus-jokes/blob/main/deployment/src/main/resources/dev-ui/qwc-jokes-web-components.js[サンプルコード]

source: https://github.com/phillip-kruger/quarkus-jokes/blob/main/runtime/src/main/java/io/quarkus/jokes/runtime/JokesJsonRPCService.java[Example code]
ja_jp: https://github.com/phillip-kruger/quarkus-jokes/blob/main/runtime/src/main/java/io/quarkus/jokes/runtime/JokesJsonRPCService.java[サンプルコード]

source: https://github.com/qomponent[Qomponent]: A few custom build components that can be used.
ja_jp: https://github.com/qomponent[Qomponent]: 使用できるカスタムビルドコンポーネントがいくつかあります。

source: https://github.com/quarkiverse/quarkus-config-extensions[Consul ConfigSource Extension]
ja_jp: https://github.com/quarkiverse/quarkus-config-extensions[Consul ConfigSource エクステンション]

source: https://github.com/quarkiverse/quarkus-hibernate-search-extras[AWS support for Hibernate Search ORM + Elasticsearch]
ja_jp: https://github.com/quarkiverse/quarkus-hibernate-search-extras[Hibernate Search ORM + ElasticsearchのAWSサポート]

source: https://github.com/quarkiverse/quarkus-vault[HashiCorp Vault ConfigSource Extension]
ja_jp: https://github.com/quarkiverse/quarkus-vault[HashiCorp Vault ConfigSource エクステンション]

source: https://github.com/quarkusio/cn.quarkus.io for Chinese (simplified)
ja_jp: https://github.com/quarkusio/cn.quarkus.io （ 簡体字中国語）

source: https://github.com/quarkusio/es.quarkus.io) for Spanish
ja_jp: https://github.com/quarkusio/es.quarkus.io （スペイン語）

source: https://github.com/quarkusio/ja.quarkus.io for Japanese
ja_jp: https://github.com/quarkusio/ja.quarkus.io （日本語）

source: https://github.com/quarkusio/quarkus/blob/582f1f78806d2268885faea7aa8f5a4d2b3f5b98/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/qwc/qwc-server-log.js#L315[Example code]
ja_jp: https://github.com/quarkusio/quarkus/blob/582f1f78806d2268885faea7aa8f5a4d2b3f5b98/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/qwc/qwc-server-log.js#L315[サンプルコード]

source: https://github.com/quarkusio/quarkus/blob/b84f13bb1a94073900328829e0b2224903179baf/extensions/devui/resources/src/main/resources/dev-ui/qwc/qwc-server-log.js#L334[Example code]
ja_jp: https://github.com/quarkusio/quarkus/blob/b84f13bb1a94073900328829e0b2224903179baf/extensions/devui/resources/src/main/resources/dev-ui/qwc/qwc-server-log.js#L334[サンプルコード]

source: https://github.com/quarkusio/quarkus/blob/main/extensions/cache/deployment/src/main/java/io/quarkus/cache/deployment/devui/CacheDevUiProcessor.java[Example code]
ja_jp: https://github.com/quarkusio/quarkus/blob/main/extensions/cache/deployment/src/main/java/io/quarkus/cache/deployment/devui/CacheDevUiProcessor.java[サンプルコード]

source: https://github.com/quarkusio/quarkus/blob/main/extensions/cache/deployment/src/main/resources/dev-ui/qwc-cache-caches.js[Example code]
ja_jp: https://github.com/quarkusio/quarkus/blob/main/extensions/cache/deployment/src/main/resources/dev-ui/qwc-cache-caches.js[サンプルコード]

source: https://github.com/quarkusio/quarkus/blob/main/extensions/cache/runtime/src/main/java/io/quarkus/cache/runtime/devui/CacheJsonRPCService.java[Example code]
ja_jp: https://github.com/quarkusio/quarkus/blob/main/extensions/cache/runtime/src/main/java/io/quarkus/cache/runtime/devui/CacheJsonRPCService.java[サンプルコード]

source: https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/qwc/qwc-footer.js[Example code]
ja_jp: https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/qwc/qwc-footer.js[サンプルコード]

source: https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/qwc/qwc-server-log.js[Example code]
ja_jp: https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/qwc/qwc-server-log.js[サンプルコード]
